{
  "backend/main.mo": "Empty Motoko actor with no implemented methods.",
  "feature_evidence.json": "Feature evidence report listing two features related to removing music functionality from ProposeDayPage.tsx.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries of all frontend files.",
  "frontend/index.css": "Tailwind base and custom OKLCH color theme with global styles for background, text, and reduced-motion support.",
  "frontend/index.html": "HTML entry point loading fonts and mounting the root React app.",
  "frontend/src/App.tsx": "Renders ProposeDayPage as the app's main component.",
  "frontend/src/components/FinalReveal.tsx": "Displays a reveal button that shows a final romantic message once clicked.",
  "frontend/src/components/ProposeDayPage.tsx": "Main proposal page with hero section, love letter content, animations, and the final reveal component.",
  "frontend/src/components/RoseDecorations.tsx": "Renders decorative roses and falling petals with scroll reveal and reduced-motion alternatives.",
  "frontend/src/components/Section.tsx": "Wrapper component applying scroll-reveal animations to its children.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor, updating on identity changes and invalidating queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, login handling, and persistent identity management.",
  "frontend/src/hooks/usePrefersReducedMotion.ts": "Hook detecting the user's prefers-reduced-motion setting.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file for future query hooks with no functionality.",
  "frontend/src/hooks/useScrollReveal.ts": "A React hook that uses IntersectionObserver to mark an element visible on scroll, respecting reduced-motion preferences.",
  "frontend/src/index.css": "Tailwind base styles with a custom rose-themed color palette, typography, motion settings, and utility classes.",
  "frontend/src/lib/utils.ts": "Provides a cn helper that merges class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Application entry point that mounts React, sets up React Query, Internet Identity, and global styles.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, fonts, radii, animations, and enabling plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata describing the Propose Day site’s goals, aesthetic direction, features, and architectural notes."
}