{
  "backend/main.mo": "Empty Motoko actor with no backend logic.",
  "feature_evidence.json": "Describes two features: replacing background audio in ProposeDayPage and adding a fade‑in effect on playback.",
  "frontend-file-summaries.txt": "Provides short summaries of all frontend source files and their roles.",
  "frontend/index.css": "Global Tailwind-based styles defining color variables, dark mode values, and base styling utilities.",
  "frontend/index.html": "HTML entry point loading romantic fonts and mounting the React app.",
  "frontend/src/App.tsx": "Main app component that renders ProposeDayPage.",
  "frontend/src/components/FinalReveal.tsx": "Shows a button that reveals a final romantic message with simple animations.",
  "frontend/src/components/ProposeDayPage.tsx": "Main page component with sections, decorations, and a full audio player with fade‑in, mute, volume, and play/pause logic.",
  "frontend/src/components/RoseDecorations.tsx": "Renders corner roses and animated or static falling petals based on reduced‑motion preference.",
  "frontend/src/components/Section.tsx": "Wrapper section that animates into view using the scroll‑reveal hook.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides authentication context and logic using Internet Identity and AuthClient.",
  "frontend/src/hooks/usePrefersReducedMotion.ts": "Detects whether the user prefers reduced motion via a media query.",
  "frontend/src/hooks/useQueries.ts": "Placeholder for React Query hooks with no backend operations.",
  "frontend/src/hooks/useScrollReveal.ts": "Provides a hook that reveals elements on scroll using IntersectionObserver, with reduced-motion support.",
  "frontend/src/index.css": "Defines Tailwind base styles, custom rose-themed OKLCH variables, dark mode tokens, accessibility focus rules, and custom utility classes.",
  "frontend/src/lib/utils.ts": "Exports a utility function combining clsx and tailwind-merge to merge class names safely.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and an Internet Identity provider, and applies global CSS.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors mapped to CSS variables, font settings, animations, and plugin integrations.",
  "project_state.json": "Stores project metadata, design goals, feature descriptions, and known issues for the romantic one-page Propose Day website."
}