{
  "kind": "build_request",
  "title": "Use 'Chaar Kadam' (male-sung portion) as background audio with fade-in on play",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-20",
      "text": "Replace the current background audio track used by the <audio> element in `frontend/src/components/ProposeDayPage.tsx` (currently `src=\"/assets/audio/propose-day-song.mp3\"`) with an audio file that contains the song “Chaar Kadam” using the male-sung portion of the lyrics, stored as a static asset under `frontend/public/assets/audio/`.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "i want the song chaar kadam in the background, the male part of lyrics sung."
        ]
      },
      "acceptanceCriteria": [
        "A single audio file containing the male-sung portion of “Chaar Kadam” exists under `frontend/public/assets/audio/`.",
        "`frontend/src/components/ProposeDayPage.tsx` references the new static audio asset path in the `<audio>` element `src` attribute.",
        "Clicking the existing Play button plays the new “Chaar Kadam” (male part) audio in a loop, and Pause stops playback."
      ]
    },
    {
      "id": "REQ-21",
      "text": "Add a subtle fade-in effect when music playback starts from the Play button in `frontend/src/components/ProposeDayPage.tsx`, so the audio ramps from silence to the user’s current effective volume (respecting mute/volume state and reduced-motion preference) over a short duration.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "and yes i would appreciate the fade eefect"
        ]
      },
      "acceptanceCriteria": [
        "When the user presses Play, the music starts at (or near) 0 volume and fades up smoothly to the current target volume within ~1–3 seconds.",
        "The fade-in respects the current volume slider value and mute state (i.e., if muted, playback remains silent).",
        "If `prefers-reduced-motion` is enabled, the fade-in is either disabled or shortened to avoid motion/discomfort while still starting playback correctly."
      ]
    }
  ],
  "constraints": [
    "Do not add any backend logic; keep audio as a static frontend asset under `frontend/public/assets/audio/`.",
    "Do not rely on autoplay; playback must be user-initiated via the existing Play control to avoid browser autoplay restrictions.",
    "Ensure you have the legal right/license to embed and distribute the “Chaar Kadam” audio file used in the site."
  ],
  "nonGoals": [
    "Building a lyrics display/karaoke feature.",
    "Adding third-party streaming integrations (Spotify/YouTube/etc.).",
    "Implementing downloads or sharing/export of the audio file."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}